{"title":"Athletics governing body working with organisers on new dates in 2022 for World Championships","slug":"athletics-governing-body-working-with-organisers-on-new-dates-in-2022-for-world-championships","title_description":"World Athletics announced its plans for rescheduling the world championships after new dates of the Tokyo Olympics were announced by the IOC and Japanese officials on Monday.","description":"thletics’ global governing body said on Monday it was now seeking dates in 2022 for the World Championships in Eugene, Oregon that were scheduled for 2021. \n We are now working with the organisers of the world athletics championships in Oregon on new dates in 2022 for our World Athletics Championships, World Athletics said in a statement.The championships had been scheduled for Aug. 6-15, 2021.World Athletics said it also was in discussions with the Commonwealth Games Federation and the European Championships.The European Championships are currently scheduled for Aug. 26-30 in Paris. The next Commonwealth Games are set for July 27-Aug. 7 in Birmingham, England.World Athletics announced its plans for rescheduling the world championships after the International Olympic Committee (IOC) and Japanese officials said the new dates for the 2020 Tokyo Olympics will be July 23-Aug. 8, 2021.The Games had been postponed for a year because of the coronavirus pandemic that has killed thousands of people around the world.This gives our athletes the time they need to get back into training and competition, World Athletics said of the new Olympics dates. Everyone needs to be flexible and compromise.The governing body added, We would like to thank our Oregon 21 Organising Committee, their stakeholders and our partners for their collaboration and willingness to explore all options.Oregon organisers were not immediately available for comment.They had said last week: (We) can reassure World Athletics that we will work with them to ensure that Oregon can still host the World Athletics Championships on alternative dates should that prove necessary.","imageUrl":"https://akm-img-a-in.tosshub.com/indiatoday/images/story/202003/RTX7AUXK-770x433.jpeg?sPGAqEcKhSB3fEkvz58x2HgysqigkKbN","sub_category":"5e80bf92ed45db23de1801bc"}